In [1]:
import pandas as pd

In [4]:
# 创建DataFrame
s_id = pd.Series(["01", "02", "03", "04", "05"])
s_class = pd.Series(["二班", "一班", "二班", "三班", "一班"])
s_grade = pd.Series([92, 67, 70, 88, 76])

df1 = pd.DataFrame({"学号": s_id, "班级": s_class, "成绩": s_grade})
df1

   学号  班级  成绩
0  01  二班  92
1  02  一班  67
2  03  二班  70
3  04  三班  88
4  05  一班  76

In [5]:
# 使用List创建DataFrame

l_id = ["01", "02", "03", "04", "05"]
l_class = ["二班", "一班", "二班", "三班", "一班"]
l_grade = [92, 67, 70, 88, 76]

df2 = pd.DataFrame({"学号": l_id, "班级": l_class, "成绩": l_grade})
df2

   学号  班级  成绩
0  01  二班  92
1  02  一班  67
2  03  二班  70
3  04  三班  88
4  05  一班  76

In [6]:
# 添加Index
s_id = pd.Series(["01", "02", "03", "04", "05"], 
                 index=["小明", "小红", "小杰", "小丽", "小华"])
s_class = pd.Series(["二班", "一班", "二班", "三班", "一班"], 
                    index=["小明", "小红", "小杰", "小丽", "小华"])
s_grade = pd.Series([92, 67, 70, 88, 76], 
                    index=["小明", "小红", "小杰", "小丽", "小华"])

df3 = pd.DataFrame({"学号": s_id, "班级": s_class, "成绩": s_grade})
df3

    学号  班级  成绩
小明  01  二班  92
小红  02  一班  67
小杰  03  二班  70
小丽  04  三班  88
小华  05  一班  76

In [ ]:
# 以dict创建DataFrame
df4 = pd.DataFrame(
    {
        "学号": 
            {"小明": "01", "小红": "02", "小杰": "03", "小丽": "04", "小华": "05"}, 
        "班级": 
            {"小明": "二班", "小红": "一班", "小杰": "二班", "小丽": "三班", "小华": "一班"},
        "成绩": 
            {"小明": 92, "小红": 67, "小杰": 70, "小丽": 88, "小华": 76}
    }
)
df4

    学号  班级  成绩
小明  01  二班  92
小红  02  一班  67
小杰  03  二班  70
小丽  04  三班  88
小华  05  一班  76

In [9]:
df4.index

Index(['小明', '小红', '小杰', '小丽', '小华'], dtype='object')

In [10]:
df4.columns

Index(['学号', '班级', '成绩'], dtype='object')

In [11]:
df4.values

array([['01', '二班', 92],
       ['02', '一班', 67],
       ['03', '二班', 70],
       ['04', '三班', 88],
       ['05', '一班', 76]], dtype=object)

In [12]:
df4.T

    小明  小红  小杰  小丽  小华
学号  01  02  03  04  05
班级  二班  一班  二班  三班  一班
成绩  92  67  70  88  76

In [13]:
df4['班级']

小明    二班
小红    一班
小杰    二班
小丽    三班
小华    一班
Name: 班级, dtype: object

In [14]:
df4['成绩']

小明    92
小红    67
小杰    70
小丽    88
小华    76
Name: 成绩, dtype: int64

In [15]:
df4.成绩

小明    92
小红    67
小杰    70
小丽    88
小华    76
Name: 成绩, dtype: int64

In [16]:
# 多列索引
df4[["学号", "成绩"]]

    学号  成绩
小明  01  92
小红  02  67
小杰  03  70
小丽  04  88
小华  05  76

In [17]:
df4.loc["小丽"]

学号    04
班级    三班
成绩    88
Name: 小丽, dtype: object

In [18]:
df4.iloc[3]

学号    04
班级    三班
成绩    88
Name: 小丽, dtype: object

In [19]:
# df切片
df4.loc["小红":"小丽"]

    学号  班级  成绩
小红  02  一班  67
小杰  03  二班  70
小丽  04  三班  88

In [24]:
# df多行查询
df4.loc[["小丽", "小红"],]

    学号  班级  成绩
小丽  04  三班  88
小红  02  一班  67

In [21]:
df4.iloc[[3, 1]]

    学号  班级  成绩
小丽  04  三班  88
小红  02  一班  67

In [22]:
# item查询
df4.loc["小红", "学号"]

'02'

In [23]:
df4.iloc[1, 0]

'02'

In [25]:
# 列切片
df4.loc[:, "班级":"成绩"]

    班级  成绩
小明  二班  92
小红  一班  67
小杰  二班  70
小丽  三班  88
小华  一班  76

In [26]:
# 索引列切片
df4.iloc[:, 1:3]

    班级  成绩
小明  二班  92
小红  一班  67
小杰  二班  70
小丽  三班  88
小华  一班  76

In [27]:
# 特殊索引
df4.iloc[[1, 3], 0:2]

    学号  班级
小红  02  一班
小丽  04  三班

In [28]:
# bool索引
df4[df4["成绩"] > 80]

    学号  班级  成绩
小明  01  二班  92
小丽  04  三班  88

In [30]:
df4["成绩"] > 80

小明     True
小红    False
小杰    False
小丽     True
小华    False
Name: 成绩, dtype: bool

In [31]:
(df4["成绩"] > 80) & (df4["班级"] == "三班")

小明    False
小红    False
小杰    False
小丽     True
小华    False
dtype: bool

In [32]:
# 取前5行
df4.head()

    学号  班级  成绩
小明  01  二班  92
小红  02  一班  67
小杰  03  二班  70
小丽  04  三班  88
小华  05  一班  76

In [34]:
# 取前两行
df4.head(2)

    学号  班级  成绩
小明  01  二班  92
小红  02  一班  67

In [35]:
# 取后3行
df4.tail(3)

    学号  班级  成绩
小杰  03  二班  70
小丽  04  三班  88
小华  05  一班  76